### fabric概念简单解释
#### Fabric的节点
Fabric的节点和人们通常熟知的比特币、以太坊有着较大的区别，主要表现在以下层面：
- 1、  众所周知，比特币、以太坊这种公有链上的节点只有两种，全节点（全部区块的历史数据）和轻节点（只和自己有关的数据），每个角色间是平等的，不含特殊功能。而Fabric的角色成员至少分为三种：主节点、背书节点、记账节点和排序节点。其中主节点、背书节点、记账节点属于组织内节点，排序节点属于组织外节点。Fabric的节点扮演的是不同的角色。
- 2、  作为公链，比特币、以太坊的节点必须全部连入公网，否则无法参与到网络交易中。而Fabric只需要把组织外节点（即排序节点）部署在公网中，而每一个参与其中的企业主体，只暴露一个主节点就可以了。这种巧妙的设计可以帮助企业不用大动干戈就可以用上区块链，同时还保证企业内网的安全。
####  Fabric的架构
Fabric的架构包括四种：
- 1、客户端。
- 2、Peer
- 3、Orderer
- 4、CA
##### 架构图如下所示：

![image](https://upload-images.jianshu.io/upload_images/6921212-34077a4a6f1967cd?imageMogr2/auto-orient/)





##### 接下来分别作介绍：
- 1、客户端是提交用户操作的地方。用户要想使用区块链，必须让客户端和peer节点以及orderer节点相连才可以。同时，为了安全，客户端必须通过****CA****认证，否则无法使用区块链。
- 2、Peer节点，即图中的主节点、背书节点和记账节点，它们统称Peer节点。
    - ①主节点：组织内部唯一和外部（Orderer节点）通信的节点。它由配置文件指定。如果下线了则可以由选举策略选出。
    - ②背书节点：为交易做保障。所有区块链上的交易、智能合约都只会运行一次，那就是在背书节点上。背书节点运行的是模拟结果。当运行、校验都没问题后，该模拟结果才能被真正记录于区块链，形成不可篡改的记录。
    - ③记账节点：最普通的节点，它除了老老实实记账外没有其他功能。
    - 需要注意的是：主节点和背书节点同时也是记账节点。
- 3、排序节点：Fabric的共识机制是由排序节点来完成的。它就做了两件事：第一、从全网客户端接收交易，将交易按规则排序。第二、将排完序的交易按固定时间间隔打包成区块，发放给主节点。
- 4、CA：Fabric的安全、认证模块。CA即证书颁发机构。它用来检查区块链的身份是否是有效、合法的。只有被****CA****机构认证的节点才可以在区块链上交易。可以用Fabric官方的CA，也可以用第三方的CA，比如国密等等。

#### Fabric的交易是什么？
- 由于Fabric上运行的主要是智能合约，因此Fabric的交易定义比比特币要宽泛很多。在比特币上，一笔交易指的就是转账。而在Fabric上，任何对数据的增删改查都是交易。
- 在Fabric上，其底层的数据库使用的是LevelDB，它是一个大的Key Value数据集合，其中Key是String，Value是byte数组。因此原则上，Fabric可以存储任意数据类型的值，并且存储的限制只依赖于用户设置的允许大小的限制。
#### Fabric的交易数据保障机制
- 和比特币以太坊这样的公链不同，Fabric先是少量peer执行，再交给排序节点排序（为了达成共识机制），最后在持久化前才验证数据的有效性。如果有节点想要作恶，背书策略和交易读写集MVCC都会防止这一情况的发生。
#### 具体交易流程
![image](https://upload-images.jianshu.io/upload_images/6921212-bc5165cd6debe106?imageMogr2/auto-orient/)
- 展开说一下一笔交易从发起到最终写入区块链的流程。
    - 如图所示，App/客户端节点负责发起交易。当然，首先它必须通过CA的证书。（第0步）
    - 随后客户端向一个或多个背书节点（Endorser）发出交易提案。（第1步）
背书节点要进行一系列的检查，然后模拟执行交易，并将交易结果签名后返回。（第1.a~第1.c步）
    - 客户端收到结果后验证。（第2步）通过后，提交给Order节点进行排序。（第3、4步）
    - 排序节点排好序后会对区块打包、广播给其他组织的主节点。（第5步）
    - 主节点收到区块后，会进行一系列检查，验证是否有效（第5.a~第5.c步）。- 无效交易不会更新数据库，即写操作。有效交易则最终更新状态数据库。（第5.d步）
    - 至此，一笔Fabric的区块链交易大功告成。
#### 验证区块链成员合法的步骤
- 区块链上最重要的就是分布式和安全。和公链不同，联盟链不允许节点任意加入，因此会对节点认证做出严格的限制。这里主要用到的是数字证书，如下所示：


![image](https://upload-images.jianshu.io/upload_images/6921212-7630efae5a178367?imageMogr2/auto-orient/strip%7CimageView2/2/w/903/format/webp)




- 证书的颁发过程和验证数字签名的过程如下：
    - 1、  证书包含了明文、密文和加密算法三要素。
    - 2、  明文发给CA，CA用自己的私钥签发证书。具体算法是CA对证书明文做一次哈希运算（SHA256）得到h1。再用自己的私钥用RSA算法将h1加密，得到密文F’。此时有了一套完整的证书。
    - 3、  验证数字证书时：先用CA的公钥解密密文F’，得到一个哈希值h2。再用证书明文F计算一次SHA256，得到密文h1。将h1和h2的值对比。如果相等，则证书校验通过，说明该客户端持有的是CA颁发的证书。
#### 未来展望
- Fabric功能强大，是目前企业级区块链的事实标准和主流框架。在后续发展中，Fabric还将持续迭代，比如引入PBFT的共识算法，取代Kafka的Order排序；引入Kubernetes管理日渐增长的链码容器；当联盟有新成员加入时，MSP可以动态更新进而认证新的证书等等。随着这些功能的补充，Fabric在商业区块链领域一枝独秀的地位将更加牢固。

